[
  {
    "ISM-1175": {
      "Description": "Privileged user accounts (excluding those explicitly authorised to access online services) are prevented from accessing the internet, email and web services."
    }
  },
  {
    "ISM-1883": {
      "Description": "Privileged user accounts explicitly authorised to access online services are strictly limited to only what is required for users and services to undertake their duties."
    }
  },
  {
    "ISM-0445": {
      "Description": "Privileged users are assigned a dedicated privileged user account to be used solely for duties requiring privileged access."
    }
  },
  {
    "ISM-1509": {
      "Description": "Privileged access events are centrally logged."
    }
  },
  {
    "ISM-1650": {
      "Description": "Privileged user account and security group management events are centrally logged."
    }
  },
  {
    "ISM-1648": {
      "Description": "Privileged access to systems and their resources are disabled after 45 days of inactivity."
    }
  },
  {
    "ISM-1647": {
      "Description": "Privileged access to systems and their resources are disabled after 12 months unless revalidated."
    }
  },
  {
    "ISM-1654": {
      "Description": "Internet Explorer 11 is disabled or removed."
    }
  },
  {
    "ISM-0843": {
      "Description": "Application control is implemented on workstations."
    }
  },
  {
    "ISM-1870": {
      "Description": "Application control is applied to user profiles and temporary folders used by operating systems, web browsers and email clients."
    }
  },
  {
    "ISM-1871": {
      "Description": "Application control is applied to all locations other than user profiles and temporary folders used by operating systems, web browsers and email clients."
    }
  },
  {
    "ISM-1657": {
      "Description": "Application control restricts the execution of executables, software libraries, scripts, installers, compiled HTML, HTML applications and control panel applets to an organisation-approved set."
    }
  },
  {
    "ISM-1544": {
      "Description": "Microsoft’s recommended application blocklist is implemented."
    }
  },
  {
    "ISM-1660": {
      "Description": "Allowed and blocked application control events are centrally logged."
    }
  },
  {
    "ISM-1889": {
      "Description": "Command line process creation events are centrally logged."
    }
  },
  {
    "ISM-1623": {
      "Description": "PowerShell module logging, script block logging and transcription events are centrally logged."
    }
  },
  {
    "ISM-1667": {
      "Description": "Microsoft Office is blocked from creating child processes."
    }
  },
  {
    "ISM-1668": {
      "Description": "Microsoft Office is blocked from creating executable content."
    }
  },
  {
    "ISM-1669": {
      "Description": "Microsoft Office is blocked from injecting code into other processes."
    }
  },
  {
    "ISM-1542": {
      "Description": "Microsoft Office is configured to prevent activation of Object Linking and Embedding packages."
    }
  },
  {
    "ISM-1859": {
      "Description": "Office productivity suites are hardened using ASD and vendor hardening guidance, with the most restrictive guidance taking precedence when conflicts occur."
    }
  },
  {
    "ISM-1823": {
      "Description": "Office productivity suite security settings cannot be changed by users."
    }
  },
  {
    "ISM-1486": {
      "Description": "Web browsers do not process Java from the internet."
    }
  },
  {
    "ISM-1485": {
      "Description": "Web browsers do not process web advertisements from the internet."
    }
  },
  {
    "ISM-1412": {
      "Description": "Web browsers are hardened using ASD and vendor hardening guidance, with the most restrictive guidance taking precedence when conflicts occur."
    }
  },
  {
    "ISM-1585": {
      "Description": "Web browser security settings cannot be changed by users."
    }
  },
  {
    "ISM-1670": {
      "Description": "PDF applications are blocked from creating child processes."
    }
  },
  {
    "ISM-1671": {
      "Description": "Microsoft Office macros are disabled for users that do not have a demonstrated business requirement."
    }
  },
  {
    "ISM-1488": {
      "Description": "Microsoft Office macros in files originating from the internet are blocked."
    }
  },
  {
    "ISM-1672": {
      "Description": "Microsoft Office macro antivirus scanning is enabled."
    }
  },
  {
    "ISM-1673": {
      "Description": "Microsoft Office macros are blocked from making Win32 API calls."
    }
  },
  {
    "ISM-1489": {
      "Description": "Microsoft Office macro security settings cannot be changed by users."
    }
  },
  {
    "ISM-1504": {
      "Description": "Multi-factor authentication is used to authenticate users to their organisation’s online services that process, store or communicate their organisation’s sensitive data."
    }
  },
  {
    "ISM-1679": {
      "Description": "Multi-factor authentication is used to authenticate users to third-party online services that process, store or communicate their organisation’s sensitive data."
    }
  },
  {
    "ISM-1680": {
      "Description": "Multi-factor authentication (where available) is used to authenticate users to third-party online services that process, store or communicate their organisation’s non-sensitive data."
    }
  },
  {
    "ISM-1892": {
      "Description": "Multi-factor authentication is used to authenticate users to their organisation’s online customer services that process, store or communicate their organisation’s sensitive customer data."
    }
  },
  {
    "ISM-1893": {
      "Description": "Multi-factor authentication is used to authenticate users to third-party online customer services that process, store or communicate their organisation’s sensitive customer data."
    }
  },
  {
    "ISM-1681": {
      "Description": "Multi-factor authentication is used to authenticate customers to online customer services that process, store or communicate sensitive customer data."
    }
  },
  {
    "ISM-1173": {
      "Description": "Multi-factor authentication is used to authenticate privileged users of systems."
    }
  },
  {
    "ISM-0974": {
      "Description": "Multi-factor authentication is used to authenticate unprivileged users of systems."
    }
  },
  {
    "ISM-1401": {
      "Description": "Multi-factor authentication uses either: something users have and something users know, or something users have that is unlocked by something users know or are."
    }
  },
  {
    "ISM-1872": {
      "Description": "Multi-factor authentication used for authenticating users of online services is phishing-resistant."
    }
  },
  {
    "ISM-1682": {
      "Description": "Multi-factor authentication used for authenticating users of systems is phishing-resistant."
    }
  },
  {
    "ISM-1683": {
      "Description": "Successful and unsuccessful multi-factor authentication events are centrally logged."
    }
  },
  {
    "ISM-1691": {
      "Description": "Patches, updates or other vendor mitigations for vulnerabilities in office productivity suites, web browsers and their extensions, email clients, PDF applications, and security products are applied within two weeks of release."
    }
  },
  {
    "ISM-1693": {
      "Description": "Patches, updates or other vendor mitigations for vulnerabilities in applications other than office productivity suites, web browsers and their extensions, email clients, PDF applications, and security products are applied within one month of release."
    }
  },
  {
    "ISM-1694": {
      "Description": "Patches, updates or other vendor mitigations for vulnerabilities in operating systems of internet-facing servers and internet-facing network devices are applied within two weeks of release when vulnerabilities are assessed as non-critical by vendors and no working exploits exist."
    }
  },
  {
    "ISM-1695": {
      "Description": "Patches, updates or other vendor mitigations for vulnerabilities in operating systems of workstations, non-internet-facing servers and non-internet-facing network devices are applied within one month of release."
    }
  },
  {
    "ISM-1704": {
      "Description": "Office productivity suites, web browsers and their extensions, email clients, PDF applications, Adobe Flash Player, and security products that are no longer supported by vendors are removed."
    }
  },
  {
    "ISM-1501": {
      "Description": "Operating systems that are no longer supported by vendors are replaced."
    }
  },
  {
    "ISM-1815": {
      "Description": "Event logs are protected from unauthorised modification and deletion."
    }
  },
  {
    "ISM-1906": {
      "Description": "Event logs from internet-facing servers are analysed in a timely manner to detect cybersecurity events."
    }
  },
  {
    "ISM-1228": {
      "Description": "Cybersecurity events are analysed in a timely manner to identify cybersecurity incidents."
    }
  }
]